chtMultiregionFoam/hot_sphere_in_oil/case_smagorinsky/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          0.01;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

maxCo           0.2;

maxDi           10.0;

adjustTimeStep  yes;


functions
{
   wallHeatFlux1
	{
	type 		wallHeatFlux;
	libs		("libfieldFunctionObjects.so");
	executeControl	writeTime;
	writeControl	writeTime;
	region		oil;
	}
   sphereHeatTrfCoeff
	{
	type 		heatTransferCoeff;
	libs		("libfieldFunctionObjects.so");
	executeControl  writeTime;
        writeControl    writeTime;
	region		oil;
	patches		("oil_to_sphere");
	field		T;
	
	htcModel	fixedReferenceTemperature;
	TRef		300;		
	}
   
   avgSphereHeatTrfCoeff
	{
	type 		surfaceFieldValue;
	libs            ("libfieldFunctionObjects.so");
	
        executeControl  writeTime;
        writeControl    writeTime;
	writeFields	yes;
	fields
	(
	heatTransferCoeff(T)
	T
	);
	
	regionType	patch;
	name		oil_to_sphere;
	operation	areaAverage;	
	region		oil;	
	surfaceFormat	none;

	}

}


// ************************************************************************* //
